Repository: shoxa1995/multilingual-telegram-bot
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: ru, uz

source: ❌ Cancel
ru: ❌ Отмена
uz: ❌ Bekor qilish

source: ⬅️ Back
ru: ⬅️ Назад
uz: ⬅️ Orqaga

source: ✅ Confirm
ru: ✅ Подтвердить
uz: ✅ Tasdiqlash

source: Free
ru: Бесплатно
uz: Bepul

source: Unknown Staff
ru: Неизвестный сотрудник
uz: Noma'lum mutaxassis

source: 👋 Welcome back to the Appointment Booking Bot! You can book appointments with our staff members, view your existing bookings, and more.
ru: 👋 Добро пожаловать обратно в бот для записи на прием! Вы можете записаться на прием к нашим специалистам, просмотреть свои текущие записи и многое другое.
uz: 👋 Qabulga yozilish botiga xush kelibsiz! Siz mutaxassislarimizga qabulga yozilishingiz, mavjud yozuvlaringizni ko'rishingiz va boshqa ko'proq imkoniyatlardan foydalanishingiz mumkin.

source: 📚 <b>Appointment Booking Bot Help</b> This bot allows you to book appointments with our staff members. <b>Available commands:</b> /start - Start the bot or return to the main menu /book - Book an appointment /mybookings - View your existing bookings /language - Change your language /help - Show this help message <b>Booking process:</b> 1. Select a staff member 2. Choose a date from the calendar 3. Pick an available time slot 4. Confirm your booking 5. Pay for the appointment (if required) After successful booking and payment, you'll receive a confirmation with a Zoom meeting link for your online appointment.
ru: 📚 <b>Справка по боту для записи на прием</b> Этот бот позволяет вам записаться на прием к нашим специалистам. <b>Доступные команды:</b> /start - Запустить бота или вернуться в главное меню /book - Записаться на прием /mybookings - Просмотреть свои записи /language - Изменить язык /help - Показать эту справку <b>Процесс записи:</b> 1. Выберите специалиста 2. Выберите дату из календаря 3. Выберите доступное время 4. Подтвердите вашу запись 5. Оплатите прием (если требуется) После успешной записи и оплаты вы получите подтверждение со ссылкой на Zoom-встречу для вашего онлайн-приема.
uz: 📚 <b>Qabulga yozilish boti yordami</b> Bu bot orqali mutaxassislarimizga qabulga yozilishingiz mumkin. <b>Mavjud buyruqlar:</b> /start - Botni ishga tushirish yoki asosiy menyuga qaytish /book - Qabulga yozilish /mybookings - Mavjud yozuvlaringizni ko'rish /language - Tilni o'zgartirish /help - Ushbu yordam xabarini ko'rsatish <b>Qabulga yozilish jarayoni:</b> 1. Mutaxassisni tanlang 2. Kalendardan sanani tanlang 3. Mavjud vaqtni tanlang 4. Yozuvingizni tasdiqlang 5. Qabul uchun to'lang (agar kerak bo'lsa) Muvaffaqiyatli ro'yxatdan o'tish va to'lovdan so'ng, onlayn qabulingiz uchun Zoom linkini olasiz.

source: I don't understand that command. Please use the menu buttons or commands.
ru: Я не понимаю эту команду. Пожалуйста, используйте кнопки меню или команды.
uz: Bu buyruqni tushunmayman. Iltimos, menyu tugmalaridan yoki buyruqlardan foydalaning.

source: Please select a staff member to book an appointment with:
ru: Пожалуйста, выберите специалиста для записи на прием:
uz: Iltimos, qabulga yozilish uchun mutaxassisni tanlang:

source: Booking process cancelled. You can start again using /book command.
ru: Процесс записи отменен. Вы можете начать заново, используя команду /book.
uz: Qabulga yozilish jarayoni bekor qilindi. Siz /book buyrug'idan foydalanib qayta boshlashingiz mumkin.

source: You can make a new booking or check your existing ones:
ru: Вы можете сделать новую запись или проверить существующие:
uz: Siz yangi yozuv qilishingiz yoki mavjud yozuvlaringizni tekshirishingiz mumkin:

source: <b>{name}</b> {description} <b>Price:</b> {price}
ru: <b>{name}</b> {description} <b>Цена:</b> {price}
uz: <b>{name}</b> {description} <b>Narx:</b> {price}

source: No description available.
ru: Описание отсутствует.
uz: Tavsif mavjud emas.

source: Photo available
ru: Фото доступно
uz: Foto mavjud

source: Please select a date for your appointment:
ru: Пожалуйста, выберите дату для вашего приема:
uz: Iltimos, qabulingiz uchun sanani tanlang:

source: Invalid navigation data.
ru: Неверные данные навигации.
uz: Noto'g'ri navigatsiya ma'lumotlari.

source: Please select a time for your appointment on {date}:
ru: Пожалуйста, выберите время для вашего приема на {date}:
uz: Iltimos, {date} sanasida qabulingiz uchun vaqtni tanlang:

source: Error: Staff member not selected. Please start over.
ru: Ошибка: Специалист не выбран. Пожалуйста, начните заново.
uz: Xato: Mutaxassis tanlanmadi. Iltimos, qayta boshlang.

source: Error: Could not find staff member or user. Please start over.
ru: Ошибка: Не удалось найти специалиста или пользователя. Пожалуйста, начните заново.
uz: Xato: Mutaxassis yoki foydalanuvchini topib bo'lmadi. Iltimos, qayta boshlang.

source: Please provide your phone number to continue with booking. You can use the button below to share your contact.
ru: Пожалуйста, укажите ваш номер телефона для продолжения записи. Вы можете использовать кнопку ниже, чтобы поделиться контактом.
uz: Qabulga yozilishni davom ettirish uchun telefon raqamingizni kiriting. Kontaktingizni ulashish uchun quyidagi tugmadan foydalanishingiz mumkin.

source: Share your phone number:
ru: Поделиться своим номером телефона:
uz: Telefon raqamingizni ulashing:

source: <b>Booking Summary</b> <b>Staff:</b> {staff_name} <b>Date:</b> {date} <b>Time:</b> {time} <b>Price:</b> {price} Please confirm your booking.
ru: <b>Сводка записи</b> <b>Специалист:</b> {staff_name} <b>Дата:</b> {date} <b>Время:</b> {time} <b>Цена:</b> {price} Пожалуйста, подтвердите вашу запись.
uz: <b>Qabulga yozilish haqida ma'lumot</b> <b>Mutaxassis:</b> {staff_name} <b>Sana:</b> {date} <b>Vaqt:</b> {time} <b>Narx:</b> {price} Iltimos, qabulga yozilishingizni tasdiqlang.

source: Please provide a valid phone number or use the button to share your contact.
ru: Пожалуйста, укажите действительный номер телефона или используйте кнопку, чтобы поделиться контактом.
uz: Iltimos, to'g'ri telefon raqami kiriting yoki kontaktingizni ulashish uchun tugmadan foydalaning.

source: Please provide a valid phone number.
ru: Пожалуйста, укажите действительный номер телефона.
uz: Iltimos, to'g'ri telefon raqamini kiriting.

source: <b>Payment Required</b> Your booking has been created, but payment is required to confirm it. <b>Amount:</b> {price} Please use the link below to complete your payment:
ru: <b>Требуется оплата</b> Ваша запись создана, но для подтверждения требуется оплата. <b>Сумма:</b> {price} Пожалуйста, используйте ссылку ниже для завершения оплаты:
uz: <b>To'lov talab qilinadi</b> Qabulga yozilishingiz yaratildi, lekin uni tasdiqlash uchun to'lov talab qilinadi. <b>Summa:</b> {price} To'lovni tugatish uchun quyidagi havoladan foydalaning:

source: Click the button below to pay:
ru: Нажмите кнопку ниже для оплаты:
uz: To'lov qilish uchun quyidagi tugmani bosing:

source: 💳 Pay Now
ru: 💳 Оплатить сейчас
uz: 💳 Hozir to'lash

source: After completing payment, please press the button below to check payment status:
ru: После завершения оплаты, пожалуйста, нажмите кнопку ниже, чтобы проверить статус платежа:
uz: To'lovni tugatgandan so'ng, to'lov holatini tekshirish uchun quyidagi tugmani bosing:

source: 🔄 Check Payment Status
ru: 🔄 Проверить статус оплаты
uz: 🔄 To'lov holatini tekshirish

source: <b>Booking Confirmed</b> Your appointment has been successfully booked. <b>Staff:</b> {staff_name} <b>Date:</b> {date} <b>Time:</b> {time}
ru: <b>Запись подтверждена</b> Ваш прием успешно забронирован. <b>Специалист:</b> {staff_name} <b>Дата:</b> {date} <b>Время:</b> {time}
uz: <b>Qabulga yozilish tasdiqlandi</b> Qabulga yozilishingiz muvaffaqiyatli amalga oshirildi. <b>Mutaxassis:</b> {staff_name} <b>Sana:</b> {date} <b>Vaqt:</b> {time}

source: <b>Zoom Meeting Link:</b> {zoom_link}
ru: <b>Ссылка на Zoom встречу:</b> {zoom_link}
uz: <b>Zoom uchrashuv havolasi:</b> {zoom_link}

source: Thank you for booking. You can view your bookings using /mybookings command.
ru: Спасибо за запись. Вы можете просмотреть свои записи, используя команду /mybookings.
uz: Qabulga yozilganingiz uchun rahmat. Siz /mybookings buyrug'idan foydalanib yozuvlaringizni ko'rishingiz mumkin.

source: Booking not found.
ru: Запись не найдена.
uz: Qabulga yozilish topilmadi.

source: Payment successful!
ru: Оплата успешна!
uz: To'lov muvaffaqiyatli amalga oshirildi!

source: <b>Payment Successful</b> Your booking has been confirmed. <b>Staff:</b> {staff_name} <b>Date:</b> {date} <b>Time:</b> {time}
ru: <b>Оплата успешна</b> Ваша запись подтверждена. <b>Специалист:</b> {staff_name} <b>Дата:</b> {date} <b>Время:</b> {time}
uz: <b>To'lov muvaffaqiyatli</b> Qabulga yozilishingiz tasdiqlandi. <b>Mutaxassis:</b> {staff_name} <b>Sana:</b> {date} <b>Vaqt:</b> {time}

source: Payment is still pending. Please wait or try again later.
ru: Оплата все еще в обработке. Пожалуйста, подождите или повторите попытку позже.
uz: To'lov hali kutilmoqda. Iltimos, kuting yoki keyinroq qayta urinib ko'ring.

source: Payment failed or was cancelled. Please try again.
ru: Оплата не удалась или была отменена. Пожалуйста, попробуйте снова.
uz: To'lov amalga oshmadi yoki bekor qilindi. Iltimos, qayta urinib ko'ring.

source: Payment failed or was cancelled. Would you like to try again?
ru: Оплата не удалась или была отменена. Хотите попробовать снова?
uz: To'lov amalga oshmadi yoki bekor qilindi. Qayta urinmoqchimisiz?

source: 💳 Try Again
ru: 💳 Попробовать снова
uz: 💳 Qayta urinish

source: ❌ Cancel Booking
ru: ❌ Отменить запись
uz: ❌ Qabulga yozilishni bekor qilish

source: Staff not found.
ru: Специалист не найден.
uz: Mutaxassis topilmadi.

source: You don't have any upcoming bookings. Use /book to make a new booking.
ru: У вас нет предстоящих записей. Используйте /book, чтобы сделать новую запись.
uz: Sizda kutilayotgan qabulga yozilishlar yo'q. Yangi qabulga yozilish uchun /book dan foydalaning.

source: Your upcoming bookings:
ru: Ваши предстоящие записи:
uz: Kutilayotgan qabulga yozilishlaringiz:

source: ❌ Close
ru: ❌ Закрыть
uz: ❌ Yopish

source: <b>Booking Details</b> <b>Staff:</b> {staff_name} <b>Date:</b> {date} <b>Time:</b> {time} <b>Status:</b> {status}
ru: <b>Детали записи</b> <b>Специалист:</b> {staff_name} <b>Дата:</b> {date} <b>Время:</b> {time} <b>Статус:</b> {status}
uz: <b>Qabulga yozilish tafsilotlari</b> <b>Mutaxassis:</b> {staff_name} <b>Sana:</b> {date} <b>Vaqt:</b> {time} <b>Holat:</b> {status}

source: 🔄 Reschedule
ru: 🔄 Перенести
uz: 🔄 Qayta rejalashtirish

source: Please select a new date for your appointment:
ru: Пожалуйста, выберите новую дату для вашего приема:
uz: Iltimos, qabulingiz uchun yangi sanani tanlang:

source: Please select a new time for your appointment on {date}:
ru: Пожалуйста, выберите новое время для вашего приема на {date}:
uz: Iltimos, {date} sanasidagi qabulingiz uchun yangi vaqtni tanlang:

source: Booking rescheduled successfully!
ru: Запись успешно перенесена!
uz: Qabulga yozilish muvaffaqiyatli qayta rejalashtirildi!

source: Your booking has been rescheduled to {date} at {time}.
ru: Ваша запись была перенесена на {date} в {time}.
uz: Qabulga yozilishingiz {date} kuni soat {time} ga qayta rejalashtirildi.

source: View Updated Booking
ru: Посмотреть обновленную запись
uz: Yangilangan qabulga yozilishni ko'rish

source: Are you sure you want to cancel this booking?
ru: Вы уверены, что хотите отменить эту запись?
uz: Haqiqatan ham ushbu qabulga yozilishni bekor qilmoqchimisiz?

source: ✅ Yes, Cancel
ru: ✅ Да, отменить
uz: ✅ Ha, bekor qilish

source: 🔙 No, Go Back
ru: 🔙 Нет, вернуться
uz: 🔙 Yo'q, orqaga qaytish

source: Your booking has been cancelled.
ru: Ваша запись была отменена.
uz: Qabulga yozilishingiz bekor qilindi.

source: Back to Bookings
ru: Вернуться к записям
uz: Qabulga yozilishlarga qaytish

source: ⏳ Pending
ru: ⏳ В ожидании
uz: ⏳ Kutilmoqda

source: 💰 Payment Pending
ru: 💰 Ожидание оплаты
uz: 💰 To'lov kutilmoqda

source: ✅ Confirmed
ru: ✅ Подтверждено
uz: ✅ Tasdiqlangan

source: ❌ Cancelled
ru: ❌ Отменено
uz: ❌ Bekor qilingan

source: ✓ Completed
ru: ✓ Завершено
uz: ✓ Tugallangan

source: Unknown
ru: Неизвестно
uz: Noma'lum

source: ◀️ Previous
ru: ◀️ Предыдущий
uz: ◀️ Oldingi

source: ▶️ Next
ru: ▶️ Следующий
uz: ▶️ Keyingi

source: 📅 Book Appointment
ru: 📅 Записаться на прием
uz: 📅 Qabulga yozilish

source: 📋 My Bookings
ru: 📋 Мои записи
uz: 📋 Mening qabullarim

source: 🌐 Change Language
ru: 🌐 Изменить язык
uz: 🌐 Tilni o'zgartirish

source: ❓ Help
ru: ❓ Помощь
uz: ❓ Yordam

source: Loading your bookings...
ru: Загрузка ваших записей...
uz: Qabulga yozilishlaringiz yuklanmoqda...
